docs: merge premium docs framework & resolve 63 security issues
